help_msg = ''' 
Щоб переглянути список сусідів:

<b>по обраному будинку</b>
Тисни: <code>Дивитись сусідів 👫 ➡ Будинок ➡ Показати всіх в цьому будинку 🏠</code>\n

<b>по обраному під\'їзду</b>
Тисни: <code>Дивитись сусідів 👫 ➡ Будинок ➡ Під\'їзд</code>\n

<b>по своєму будинку</b>
Тисни: <code>'Мій будинок 🏠'</code>

<b>по своєму під\'їзду</b>
Тисни: <code>'Мій під\'їзд 🔢'</code>

Щоб додати або змінити свої дані:

Тисни: <code>Змінити свої дані ✏</code>, і вибери свої <i>будинок, під\'їзд, поверх, квартиру</i>\n

Виключні ситуації:

Якщо бажаєте додати більше однієї квартири, напишіть про це <a href="tg://user?id=422485737">сюди</a>
'''

about_msg = '''
Привіт!

Я бот, який допомогає формувати список мешканців ЖК Перемога. Його можна переглянути та зв'язатися зі своїм сусідом. Також я вмію вітати нових користувачив в чаті, показувати статистику та важливу інфу.

Службові команди:
/start - головне меню
/help - опис функціоналу
/about - про бота

З пропозиціями та зауваженнями звертайтесь <a href="tg://user?id=422485737">сюди</a>.
'''

building_msg = '''
💠 Головні ресурси для сусідів ЖК Перемоги

👉 <a href="https://t.me/podedi_bot">Корисний інфобот</a>
👉 <a href="https://t.me/peremoga_vazhno">Канал Терміново/Важливо</a>

💠 Комендант Світлана Юріївна

📞 +380577648147
🔸 Графік роботи: ПН-ПТ 8.30-16.00 Перерва: 12: 00-13: 00
🔸 Знаходиться на першому поверсі 4-го під\'їзду 89-го будинку

💠 Поштовий індекс та повна адреса

🔸 61174, пр. Перемоги, буд. 85/87/89

💠 Поштові відділення

🔸 УкрПошта відділення №174 - пр. Перемоги, 75-а, @ukrposhta_chatbot
🔸 НоваПошта №53 (до 30 кг) - пр. Перемоги, 65-г (зуп. Шкільна), @NovaPoshta_Bot
🔸 МістЕкспресс - пр. Перемоги 70-а (зуп. Сонячна)

💠 Сплатити за комунальні послуги

👉 <a href="https://www.privat24.ua/">privat24</a>
👉 <a href="https://erc.megabank.net/ru">megabank</a>

💠 Передати показання приладів обліку

👉 <a href="http://cab.busha.in/">Всі кабінети в одному місці</a>
👉 <a href="http://billing.vodokanal.kharkov.ua">КП Харьківводоканал</a> - показання приладів обліку води (холодної та гарячої) необхідно передавати до 20 числа за поточний місяць.
👉 <a href="https://www.hts.kharkov.ua/cabinet/login">КП ХТМ (Харківські теплові мережі)</a> - показання приладів обліку гарячої води необхідно передавати до 20 числа за поточний місяць. Показання лічільників тепла треба передавати до 26 числа за поточний місяць у період опалювального сезону.
❗ Майте на увазі, що показання по гарячій воді передані для КП «Харківводоканал» зберігаються незалежно і в розрахунках КП «ХТМ» не враховуються.
👉 <a href="https://104.ua/ua/cabinet/">АТ ХарківГаз</a> - показання лічильника газу передаються з 1 по 5 число за минулий місяц.
👉 АТ Харківобленерго - показання лічильника електроенергії передаються з 1 по 4 число за минулий місяц.

💠 ЖЕК ЖС-1

📞 +380573383067
🔸 вул. Целіноградська, 42
🔸 Прийом громадян: ПН, ЧТ 13:00-17:00

💠 Аварійна Міськліфту

📞 +380675426021

💠 Інтернет-провайдери/кабельне ТБ

👉 <a href="https://maxnet.ua/">Макснет</a>, @maxnetua_bot
👉 <a href="http://triolan.com/">Триолан</a>, @triolan_info_bot
👉 <a href="https://www.untc.ua/">UNTC</a>

💠 Поліклініки

🏥 14 дитяча - пр. Людвіга Свободи, 48-В,
📞 +380577250399
📞 +380577250385

🏥 <a href="http://8pol.city.kharkov.ua/">8 поліклініка</a> - пр. Перемоги, 53,
📞 +380577251140
📞 +380577251141
 
🏥 <a href="https://cab.mcplus.com.ua/">Виклик лікаря додому або запис на прийом</a>

💠 Приватні клініки

🏥 <a href="https://www.unilic.com.ua/">УніЛік</a>, медичний центр - пр. Перемоги, 67-В
🏥 <a href="http://myfamily-doctor.com.ua/">Сімейний доктор</a>, медичний центр - пр. Перемоги, 64
🏥 <a href="https://alternativa-mc.com.ua/">Альтернатива</a>, медичний центр - пр. Л. Свободи, 50-В
🏥 <a href="https://aremit.com.ua/">Ареміт</a>, медичний центр - пр. Е. Ахсарова, 8
🏥 <a href="http://analitika-lab.com.ua/">Аналітика</a>, медична лабораторія - пр. Л. Свободи, 32
🏥 <a href="https://doctorlor.com.ua/">Доктор Лор</a>, медичний кабінет - пр. Л. Свободи, 31
🏥 <a href="http://dynasty-clinic.com.ua/">Дінастія</a>, ЛОР кабінет і стоматологія - пр. Перемоги, 66-І

💠 Стоматологія

🏥 Стоматологічна поліклініка №7 - пр. Перемоги, 53-А, +380577250788
🏥 <a href="hhttps://morozov-clinic.kh.ua/">Стоматологічна клініка доктора Морозова</a> - пр. Перемоги, 85
🏥 ПП Уваров, стомат. кабінет - пр. Перемоги, 73-Б, +380502691873
🏥 Університетський стоматологічний центр ХНМУ - пр. Перемоги, 51-Б, +380577732498
🏥 Науменко А.В., стомат. кабінет - пр. Перемоги, 52-Б, +380977507909
🏥 <a href="http://dental.kharkov.ua/">Dental Union Studio</a> - пр. Перемоги, 58-А
🏥 «Stomat», стоматологія - пр. Л. Свободи, 53-Б
🏥 Аполлонія, стоматологія - пр. Л. Свободи, 41, +380965305212
🏥 <a href="http://www.grand-stom.com/">Гранд</a>, стоматологія - пр. Л. Свободи, 31
🏥 DDS, стомат. кабінет - пр. Л. Свободи, 50-В, +380507419072
🏥 Shark, стоматологічна клініка - вул. Целіноградська, 50, +380573370171
🏥 Астра, стоматологія - вул. Ахсарова, 4/6-А, +380577733133
🏥 <a href="https://to-day.com.ua/">TODAY</a>, стоматологічна клініка - вул. Ахсарова, 13
🏥 <a href="http://vash-stomatolog.com.ua/">Ваш стоматолог</a>, стоматологія - вул. Ахсарова, 18
🏥 <a href="https://www.facebook.com/dentalparkKharkiv/">Dental Park</a>, стоматологія - вул. Е. Ахсарова, 17-Г


💠 Ветеринарія

🐶 Айболит, вет. кабінет - пр. Перемоги, 77-Г
🐶 <a href="http://zoodoctor.kharkov.ua/">ЗооДоктор</a>, вет. клініка - пр. Л. Свободи, 60-А
🐶 <a href="http://vetexpert.com.ua/">VETEXPERT</a>, вет. клініка - пр. Перемоги, 65-Г
🐶 Пухнастик, вет. кабінет - пр. Перемоги, 55-Е 

💠 Ми на мапі

👉 <a href = "https://www.google.com/maps/place/%D0%BF%D1%80%D0%BE%D1%81%D0%BF.+%D0%9F%D0%BE % D0% B1% D0% B5% D0% B4% D1% 8B, +85, +% D0% A5% D0% B0% D1% 80% D1% 8C% D0% BA% D0% BE% D0% B2, +% D0% A5% D0% B0% D1% 80% D1% 8C% D0% BA% D0% BE% D0% B2% D1% 81% D0% BA% D0% B0% D1% 8F +% D0% BE% D0% B1% D0% BB% D0% B0% D1% 81% D1% 82% D1% 8C, + 61000 / @ 50.0704593,36.2092955,17z / data =! 3m1! 4b1! 4m5! 3m4! 1s0x4127a43aea3b016f: 0xbdcdffe331b57988! 8m2 ! 3d50.0704593! 4d36.2114842 ">ГуглМап</a>
👉 <a href="https://2gis.ua/kharkov/geo/15481759374266615?queryState=center%2F36.211313%2C50.070421%2Fzoom%2F17">2ГІС</a>
'''

greeting_msg = '''
Вітаю, {}! Давайте знайомитись,
додайтесь до списку сусідів в @peremogy_susid_bot та прочитайте <a href="https://t.me/c/1118126927/118497">важливу інформацию</a> для новачків.
'''

house_85 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
    'section_3': [i for i in range(1, 10)] + ['8-9'],
    'section_4': [i for i in range(1, 10)] + ['8-9'],
    'section_5': [i for i in range(1, 10)] + ['8-9'],
    'section_6': [i for i in range(1, 10)] + ['8-9'],
}

house_87 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
}

house_89 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
    'section_3': [i for i in range(1, 10)] + ['8-9'],
    'section_4': [i for i in range(1, 10)] + ['8-9'],
    'section_5': [i for i in range(1, 10)] + ['8-9'],
    'section_6': [i for i in range(1, 10)] + ['8-9'],
}

houses_arr = {
    'house_85': house_85,
    'house_87': house_87,
    'house_89': house_89,
}