help_msg = ''' 
Щоб переглянути список сусідів:

<b>по обраному будинку</b>
Тисни: <code>Дивитись сусідів 👫 ➡ Будинок ➡ Показати всіх в цьому будинку 🏠</code>\n

<b>по обраному під\'їзду</b>
Тисни: <code>Дивитись сусідів 👫 ➡ Будинок ➡ Під\'їзд</code>\n

<b>по своєму будинку</b>
Тисни: <code>'Мій будинок 🏠'</code>

<b>по своєму під\'їзду</b>
Тисни: <code>'Мій під\'їзд 🔢'</code>

Щоб додати або змінити свої дані:

Тисни: <code>Змінити свої дані ✏</code>, і вибери свої <i>будинок, під\'їзд, поверх, квартиру</i>\n

Виключні ситуації:

Якщо бажаєте додати більше однієї квартири, напишіть про це <a href="tg://user?id=422485737">сюди</a>
'''

about_msg = '''
Привіт!

Я бот, який допомогає формувати список мешканців ЖК Перемога. Його можна переглянути та зв'язатися зі своїм сусідом. Також я вмію вітати нових користувачив в чаті, показувати статистику та важливу інфу.

Службові команди:
/start - головне меню
/help - опис функціоналу
/about - про бота

З пропозиціями та зауваженнями звертайтесь <a href="tg://user?id=422485737">сюди</a>.
'''

building_msg = '''
💠 Головні ресурси для сусідів ЖК Перемоги

👉 <a href="https://t.me/podedi_bot">Корисний інфобот</a>
👉 <a href="https://t.me/peremoga_vazhno">Канал Срочно/Важно</a>
👉 <a href="https://t.me/joinchat/AA8Nu0KlQ0_EE8nxd2oMfg">Главный чат</a>
👉 <a href="https://t.me/joinchat/AA8Nuw0ucJV9huouwbKBGg">Куплю/Продам</a>
👉 <a href="https://t.me/joinchat/Ds_MakHKn3yMUKgRjMbFqw">Авточат</a>
👉 <a href="https://t.me/joinchat/GdJschAO8ZtoIk5gwtsyaw">Мамы</a>

💠 Комендант Світлана Юріївна

📞 +380577648147
🔸 Графік роботи: ПН-ПТ 8.30-16.00 Перерва: 12: 00-13: 00
🔸 Знаходиться на першому поверсі 4-го під\'їзду 89-го будинку

💠 Поштовий індекс та повна адреса

🔸 61174, пр. Перемоги, буд. 85/87/89

💠 Поштові відділення

🔸 УкрПошта відділення №174 - пр. Перемоги, 75а
🔸 НоваПошта №53 (до 30 кг) - пр. Перемоги, 65г (зуп. Шкільна)
🔸 МістЕкспресс - пр. Перемоги 70а (зуп. Сонячна)

💠 Комунальні послуги

👉 <a href="http://cab.busha.in/">Сервіс для сплати за ком. послуги</a> - всі кабінети в одному місці, дуже зручно.
👉 <a href="https://www.privat24.ua/">privat24</a>
👉 <a href="https://erc.megabank.net/ru">megabank</a>

💠 ЖЕК ЖС-1

📞 +380573383067
🔸 вул. Целіноградська, 42
🔸 Прийом громадян: ПН, ЧТ 13:00-17:00

💠 Аварійна Міськліфту

📞 +380675426021

💠 Інтернет-провайдери/кабельне ТБ

👉 <a href="https://maxnet.ua/">Макснет</a>
👉 <a href="https://www.untc.ua/">UNTC</a>

💠 Поліклініки

💉 14 дитяча - пр. Людвіга Свободи, 48-В,
📞 +380577250399
📞 +380577250385

💉 <a href="http://8pol.city.kharkov.ua/">8 поліклініка</a> - пр. Перемоги, 53,
📞 +380577251140
📞 +380577251141
 
💉 <a href="https://cab.mcplus.com.ua/">Виклик лікаря додому або запис на прийом</a>

💠 Ми на мапі

👉 <a href = "https://www.google.com/maps/place/%D0%BF%D1%80%D0%BE%D1%81%D0%BF.+%D0%9F%D0%BE % D0% B1% D0% B5% D0% B4% D1% 8B, +85, +% D0% A5% D0% B0% D1% 80% D1% 8C% D0% BA% D0% BE% D0% B2, +% D0% A5% D0% B0% D1% 80% D1% 8C% D0% BA% D0% BE% D0% B2% D1% 81% D0% BA% D0% B0% D1% 8F +% D0% BE% D0% B1% D0% BB% D0% B0% D1% 81% D1% 82% D1% 8C, + 61000 / @ 50.0704593,36.2092955,17z / data =! 3m1! 4b1! 4m5! 3m4! 1s0x4127a43aea3b016f: 0xbdcdffe331b57988! 8m2 ! 3d50.0704593! 4d36.2114842 ">ГуглМап</a>
👉 <a href="https://2gis.ua/kharkov/geo/15481759374266615?queryState=center%2F36.211313%2C50.070421%2Fzoom%2F17">2ГІС</a>
'''

greeting_msg = '''
Вітаю {}! Давайте знайомитись,
додайтесь до списку сусідів в @peremogy_susid_bot.
'''

house_85 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
    'section_3': [i for i in range(1, 10)] + ['8-9'],
    'section_4': [i for i in range(1, 10)] + ['8-9'],
    'section_5': [i for i in range(1, 10)] + ['8-9'],
    'section_6': [i for i in range(1, 10)] + ['8-9'],
}

house_87 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
}

house_89 = {
    'section_1': [i for i in range(1, 10)] + ['8-9'],
    'section_2': [i for i in range(1, 10)] + ['8-9'],
    'section_3': [i for i in range(1, 10)] + ['8-9'],
    'section_4': [i for i in range(1, 10)] + ['8-9'],
    'section_5': [i for i in range(1, 10)] + ['8-9'],
    'section_6': [i for i in range(1, 10)] + ['8-9'],
}

houses_arr = {
    'house_85': house_85,
    'house_87': house_87,
    'house_89': house_89,
}